In [1]:
import pandas as pd
import numpy as np
data_gadget = {
    'Product': ['iPhone 15', 'Samsung S24', 'MacBook Air M2', 'Dell XPS 13', 'iPad Pro',
                'Galaxy Tab S9', 'Sony WH-1000XM5', 'AirPods Pro 2', 'Apple Watch 9', 'Galaxy Watch 6'],
    'Brand': ['Apple', 'Samsung', 'Apple', 'Dell', 'Apple',
              'Samsung', 'Sony', 'Apple', 'Apple', 'Samsung'],
    'Price': [16000000, 15000000, 19000000, 20000000, 14000000,
              13000000, 5000000, 4000000, 7000000, 4500000],
    'Stock': [50, 45, 20, 15, 30, 25, 60, 100, 40, 35],
    'Rating': [4.8, 4.7, 4.9, 4.5, 4.8, 4.6, 4.9, 4.7, 4.6, 4.4]
}

gadgets = pd.DataFrame(data_gadget)
gadgets.head()

          Product    Brand     Price  Stock  Rating
0       iPhone 15    Apple  16000000     50     4.8
1     Samsung S24  Samsung  15000000     45     4.7
2  MacBook Air M2    Apple  19000000     20     4.9
3     Dell XPS 13     Dell  20000000     15     4.5
4        iPad Pro    Apple  14000000     30     4.8

In [2]:
# Cek info dari DataFrame
gadgets.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Product  10 non-null     str
 1   Brand    10 non-null     str
 2   Price    10 non-null     int64
 3   Stock    10 non-null     int64
 4   Rating   10 non-null     float64
dtypes: float64(1), int64(2), str(2)
memory usage: 532.0 bytes

In [3]:
# Cek statistik deskriptif
gadgets.describe()

              Price       Stock     Rating
count  1.000000e+01   10.000000  10.000000
mean   1.175000e+07   42.000000   4.690000
std    6.115781e+06   24.630604   0.166333
min    4.000000e+06   15.000000   4.400000
25%    5.500000e+06   26.250000   4.600000
50%    1.350000e+07   37.500000   4.700000
75%    1.575000e+07   48.750000   4.800000
max    2.000000e+07  100.000000   4.900000

In [4]:
# Cek tipe data setiap kolom
gadgets.dtypes

Product        str
Brand          str
Price        int64
Stock        int64
Rating     float64
dtype: object

In [5]:
# Cek struktur DataFrame
gadgets.shape

(10, 5)

In [7]:
# Buat kolom baru 'Total_value' yang merupakan hasil perkalian antara 'Price' dan 'Stock'
total_value = gadgets['Price'] * gadgets['Stock']
gadgets['Total_value'] = total_value
# gadgets['Total_value'] = gadgets['Price'] * gadgets['Stock']
gadgets.head()

          Product    Brand     Price  Stock  Rating  Total_value
0       iPhone 15    Apple  16000000     50     4.8    800000000
1     Samsung S24  Samsung  15000000     45     4.7    675000000
2  MacBook Air M2    Apple  19000000     20     4.9    380000000
3     Dell XPS 13     Dell  20000000     15     4.5    300000000
4        iPad Pro    Apple  14000000     30     4.8    420000000

In [8]:
# Urutkan DataFrame berdasarkan Total_value dari yang terbesar ke yang terkecil
gadgets_sorted = gadgets.sort_values(by='Total_value', ascending=False)
gadgets_sorted.head()

          Product    Brand     Price  Stock  Rating  Total_value
0       iPhone 15    Apple  16000000     50     4.8    800000000
1     Samsung S24  Samsung  15000000     45     4.7    675000000
4        iPad Pro    Apple  14000000     30     4.8    420000000
7   AirPods Pro 2    Apple   4000000    100     4.7    400000000
2  MacBook Air M2    Apple  19000000     20     4.9    380000000

In [9]:
# Fiter produk premium dengan kondisi Price > 15 juta dan Stock < 30
premium_gadgets = gadgets[(gadgets['Price'] > 15000000) & (gadgets['Stock'] < 30)]
premium_gadgets

          Product  Brand     Price  Stock  Rating  Total_value
2  MacBook Air M2  Apple  19000000     20     4.9    380000000
3     Dell XPS 13   Dell  20000000     15     4.5    300000000